In [86]:
import os
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import inspect

# Load and Store  ABS ERP CSV into DataFrame
Load CSV

In [140]:
#csv_file = os.path.join('..', 'Resources', 'ABS_ERP_COMP_CLEAN.csv')
csv_file = "Resources/ABS_ERP_COMP_CLEAN.csv"
erp_data_df = pd.read_csv(csv_file)
erp_data_df.head()

,DATAFLOW,MEASURE: Measure,REGION: Region,FREQ: Frequency,TIME_PERIOD: Time Period,OBS_VALUE,UNIT_MEASURE: Unit of Measure,UNIT_MULT: Unit of Multiplier,OBS_STATUS: Observation Status,OBS_COMMENT: Observation Comment
0,ABS:ERP_COMP_Q(1.0.0),Net Internal Migration,Western Australia,Q: Quarterly,1981-Q2,680.0,NUM: Number,0: Units,NaN,NaN
1,ABS:ERP_COMP_Q(1.0.0),Net Internal Migration,Western Australia,Q: Quarterly,1981-Q3,2002.0,NUM: Number,0: Units,NaN,NaN
2,ABS:ERP_COMP_Q(1.0.0),Net Internal Migration,Western Australia,Q: Quarterly,1981-Q4,441.0,NUM: Number,0: Units,NaN,NaN
3,ABS:ERP_COMP_Q(1.0.0),Net Internal Migration,Western Australia,Q: Quarterly,1982-Q1,494.0,NUM: Number,0: Units,NaN,NaN
4,ABS:ERP_COMP_Q(1.0.0),Net Internal Migration,Western Australia,Q: Quarterly,1982-Q2,621.0,NUM: Number,0: Units,NaN,NaN

TEMP file for INDEX resets for STATEs and QUARTERS

In [141]:
new_test_region_df = erp_data_df[['REGION: Region']].copy()
new_test_region_df.head()

       REGION: Region
0   Western Australia
1   Western Australia
2   Western Australia
3   Western Australia
4   Western Australia

In [142]:
new_test_quarter_df = erp_data_df[['TIME_PERIOD: Time Period']].copy()
new_test_quarter_df.head()

  TIME_PERIOD: Time Period
0                  1981-Q2
1                  1981-Q3
2                  1981-Q4
3                  1982-Q1
4                  1982-Q2

In [143]:
new_test_region_df = new_test_region_df.sort_values('REGION: Region').drop_duplicates('REGION: Region', keep='last')

In [144]:
new_test_quarter_df = new_test_quarter_df.sort_values('TIME_PERIOD: Time Period').drop_duplicates('TIME_PERIOD: Time Period', keep='last')

In [145]:
#new_test_df=new_test_df.set_index(name="index",start=100)
new_test_region_df.reset_index(level=0, inplace=True)
new_test_region_df

   index                 REGION: Region
0    214                      Australia
1   1420   Australian Capital Territory
2   1309                New South Wales
3   2838             Northern Territory
4   2292                     Queensland
5    868                South Australia
6    983                       Tasmania
7   2456                       Victoria
8      0              Western Australia

In [146]:
#new_test_df=new_test_df.set_index(name="index",start=100)
new_test_quarter_df.reset_index(level=0, inplace=True)
new_test_quarter_df

     index TIME_PERIOD: Time Period
0     1639                  1981-Q2
1     2788                  1981-Q3
2     1969                  1981-Q4
3     1314                  1982-Q1
4     2955                  1982-Q2
..     ...                      ...
159    322                  2021-Q1
160   2947                  2021-Q2
161    324                  2021-Q3
162   2293                  2021-Q4
163   3114                  2022-Q1

[164 rows x 2 columns]

In [147]:
#REGION
new_test_region_df.rename(columns = {'index':'state_id', 'REGION: Region': 'state_name'}, inplace=True)
new_test_region_df

   state_id                     state_name
0       214                      Australia
1      1420   Australian Capital Territory
2      1309                New South Wales
3      2838             Northern Territory
4      2292                     Queensland
5       868                South Australia
6       983                       Tasmania
7      2456                       Victoria
8         0              Western Australia

In [148]:
new_test_quarter_df.rename(columns = {'index':'quarter_id', 'TIME_PERIOD: Time Period': 'date_quarter'}, inplace=True)
new_test_quarter_df

     quarter_id date_quarter
0          1639      1981-Q2
1          2788      1981-Q3
2          1969      1981-Q4
3          1314      1982-Q1
4          2955      1982-Q2
..          ...          ...
159         322      2021-Q1
160        2947      2021-Q2
161         324      2021-Q3
162        2293      2021-Q4
163        3114      2022-Q1

[164 rows x 2 columns]

# Load and Store ABS AWE CSV into DataFrame
Load CSV

In [121]:
csv_file = "Resources/ABS_AWE_CLEAN.csv"
awe_data_df = pd.read_csv(csv_file)
awe_data_df.head()

,DATAFLOW,MEASURE: Measure,ESTIMATE_TYPE: Estimate Type,SEX: Sex,SECTOR: Sector,INDUSTRY: Industry,TSEST: Adjustment Type,REGION: Region,FREQ: Frequency,TIME_PERIOD: Time Period,OBS_VALUE,UNIT_MEASURE: Unit of Measure,OBS_STATUS: Observation Status,OBS_COMMENT: Observation Comment
0,ABS:AWE(1.0.0),All employees average weekly total earnings,Earnings,3: Persons,Private and Public,TOT: All Industries,Original,Northern Territory,Q: Quarterly,1994-Q4,564.4,AUD: Australian Dollars,NaN,NaN
1,ABS:AWE(1.0.0),All employees average weekly total earnings,Earnings,3: Persons,Private and Public,TOT: All Industries,Original,Northern Territory,Q: Quarterly,1995-Q2,564.7,AUD: Australian Dollars,NaN,NaN
2,ABS:AWE(1.0.0),All employees average weekly total earnings,Earnings,3: Persons,Private and Public,TOT: All Industries,Original,Northern Territory,Q: Quarterly,1995-Q4,567.6,AUD: Australian Dollars,NaN,NaN
3,ABS:AWE(1.0.0),All employees average weekly total earnings,Earnings,3: Persons,Private and Public,TOT: All Industries,Original,Northern Territory,Q: Quarterly,1996-Q2,571.0,AUD: Australian Dollars,NaN,NaN
4,ABS:AWE(1.0.0),All employees average weekly total earnings,Earnings,3: Persons,Private and Public,TOT: All Industries,Original,Northern Territory,Q: Quarterly,1996-Q4,581.6,AUD: Australian Dollars,NaN,NaN

Check Data Types

In [93]:
awe_data_df.dtypes

DATAFLOW                             object
MEASURE: Measure                     object
ESTIMATE_TYPE: Estimate Type         object
SEX: Sex                             object
SECTOR: Sector                       object
INDUSTRY: Industry                   object
TSEST: Adjustment Type               object
REGION: Region                       object
FREQ: Frequency                      object
TIME_PERIOD: Time Period             object
OBS_VALUE                           float64
UNIT_MEASURE: Unit of Measure        object
OBS_STATUS: Observation Status       object
OBS_COMMENT: Observation Comment    float64
dtype: object

In [94]:
new_test2_df = awe_data_df[['REGION: Region']].copy()
new_test2_df.head()

        REGION: Region
0   Northern Territory
1   Northern Territory
2   Northern Territory
3   Northern Territory
4   Northern Territory

In [95]:
new_test2_df = new_test2_df.sort_values('REGION: Region').drop_duplicates('REGION: Region', keep='last')

In [109]:
#new_test_df=new_test_df.set_index(name="index",start=100)
new_test2_df.reset_index(level=0, inplace=True)
new_test2_df

      index       REGION: Region
0         0   Northern Territory
1         1   Northern Territory
2         2   Northern Territory
3         3   Northern Territory
4         4   Northern Territory
...     ...                  ...
5763   5763            Australia
5764   5764            Australia
5765   5765            Australia
5766   5766            Australia
5767   5767            Australia

[5768 rows x 2 columns]

In [110]:
# Delete column we don't want
del awe_data_df['DATAFLOW']
del awe_data_df['OBS_STATUS: Observation Status']
del awe_data_df['OBS_COMMENT: Observation Comment']
del awe_data_df['UNIT_MEASURE: Unit of Measure']
del awe_data_df['TSEST: Adjustment Type']
del awe_data_df['SEX: Sex']
del awe_data_df['FREQ: Frequency']
awe_data_df.head()

,MEASURE: Measure,ESTIMATE_TYPE: Estimate Type,SECTOR: Sector,INDUSTRY: Industry,REGION: Region,TIME_PERIOD: Time Period,OBS_VALUE
0,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4
1,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1995-Q2,564.7
2,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1995-Q4,567.6
3,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1996-Q2,571.0
4,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1996-Q4,581.6

In [111]:
# Merge two dataframes using an inner join
awe_merge_df = pd.merge(awe_data_df, new_test2_df, on="REGION: Region")
awe_merge_df

,MEASURE: Measure,ESTIMATE_TYPE: Estimate Type,SECTOR: Sector,INDUSTRY: Industry,REGION: Region,TIME_PERIOD: Time Period,OBS_VALUE,index
0,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4,0
1,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4,1
2,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4,2
3,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4,3
4,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4,4
...,...,...,...,...,...,...,...,...
13073979,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Australian Capital Territory,2022-Q2,1725.1,3691
13073980,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Australian Capital Territory,2022-Q2,1725.1,3692
13073981,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Australian Capital Territory,2022-Q2,1725.1,3693
13073982,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Australian Capital Territory,2022-Q2,1725.1,3694
13073983,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Australian Capital Territory,2022-Q2,1725.1,3695

In [114]:
# Identify incomplete rows
awe_merge_df.count()

MEASURE: Measure                13073984
ESTIMATE_TYPE: Estimate Type    13073984
SECTOR: Sector                  13073984
INDUSTRY: Industry              13073984
REGION: Region                  13073984
TIME_PERIOD: Time Period        13073984
OBS_VALUE                       13073984
index                           13073984
dtype: int64

In [112]:
# Identify incomplete rows
awe_data_df.count()

MEASURE: Measure                5768
ESTIMATE_TYPE: Estimate Type    5768
SECTOR: Sector                  5768
INDUSTRY: Industry              5768
REGION: Region                  5768
TIME_PERIOD: Time Period        5768
OBS_VALUE                       5768
dtype: int64

In [100]:
new_test2_df = awe_data_df[['REGION: Region']].copy()
new_test2_df.head()

        REGION: Region
0   Northern Territory
1   Northern Territory
2   Northern Territory
3   Northern Territory
4   Northern Territory

In [101]:
# Rename columns 
awe_data_df = awe_data_df.rename(columns={"MEASURE: Measure": "measure_id","REGION: Region": "region", "TIME_PERIOD: Time Period": "quarter_id",
                                              "OBS_VALUE": "net_change","ESTIMATE_TYPE: Estimate Type":"type_id","SECTOR: Sector":"sector_id","INDUSTRY: Industry":"industry_id"})
awe_data_df

,measure_id,type_id,sector_id,industry_id,state_id,quarter_id,net_change
0,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1994-Q4,564.4
1,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1995-Q2,564.7
2,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1995-Q4,567.6
3,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1996-Q2,571.0
4,All employees average weekly total earnings,Earnings,Private and Public,TOT: All Industries,Northern Territory,1996-Q4,581.6
...,...,...,...,...,...,...,...
5763,All employees average weekly total earnings,Earnings,Private and Public,P: Education and Training,Australia,2020-Q2,1211.4
5764,All employees average weekly total earnings,Earnings,Private and Public,P: Education and Training,Australia,2020-Q4,1202.9
5765,All employees average weekly total earnings,Earnings,Private and Public,P: Education and Training,Australia,2021-Q2,1236.1
5766,All employees average weekly total earnings,Earnings,Private and Public,P: Education and Training,Australia,2021-Q4,1250.5
5767,All employees average weekly total earnings,Earnings,Private and Public,P: Education and Training,Australia,2022-Q2,1256.2

In [61]:
# Display a statistical overview
# We can infer the maximum allowable individual contribution from 'max'
awe_data_df.describe()

        net_change
count  5768.000000
mean    960.604334
std     398.045259
min     257.500000
25%     657.400000
50%     888.800000
75%    1206.800000
max    2841.800000

In [62]:
awe_data_df.to_csv("Resources/johan_awe_employment_clean.csv", index=False)

### Clean DataFrame

In [63]:
# Identify incomplete rows
awe_data_df.count()

measure_id     5768
type_id        5768
sector_id      5768
industry_id    5768
state_id       5768
quarter_id     5768
net_change     5768
dtype: int64

In [64]:
new_awe_data_df = awe_data_df[['measure_id','state_id','quarter_id','net_change','type_id','sector_id','industry_id']].copy()
new_awe_data_df.head()

,measure_id,state_id,quarter_id,net_change,type_id,sector_id,industry_id
0,All employees average weekly total earnings,Northern Territory,1994-Q4,564.4,Earnings,Private and Public,TOT: All Industries
1,All employees average weekly total earnings,Northern Territory,1995-Q2,564.7,Earnings,Private and Public,TOT: All Industries
2,All employees average weekly total earnings,Northern Territory,1995-Q4,567.6,Earnings,Private and Public,TOT: All Industries
3,All employees average weekly total earnings,Northern Territory,1996-Q2,571.0,Earnings,Private and Public,TOT: All Industries
4,All employees average weekly total earnings,Northern Territory,1996-Q4,581.6,Earnings,Private and Public,TOT: All Industries

In [65]:
average_aernings_df = awe_data_df[['state_id','quarter_id','net_change']].copy()
average_aernings_df.head()

              state_id quarter_id  net_change
0   Northern Territory    1994-Q4       564.4
1   Northern Territory    1995-Q2       564.7
2   Northern Territory    1995-Q4       567.6
3   Northern Territory    1996-Q2       571.0
4   Northern Territory    1996-Q4       581.6

In [66]:
#Rename columns 
average_aernings_df = average_aernings_df.rename(columns={"net_change": "avg_earnings"})
average_aernings_df

                 state_id quarter_id  avg_earnings
0      Northern Territory    1994-Q4         564.4
1      Northern Territory    1995-Q2         564.7
2      Northern Territory    1995-Q4         567.6
3      Northern Territory    1996-Q2         571.0
4      Northern Territory    1996-Q4         581.6
...                   ...        ...           ...
5763            Australia    2020-Q2        1211.4
5764            Australia    2020-Q4        1202.9
5765            Australia    2021-Q2        1236.1
5766            Australia    2021-Q4        1250.5
5767            Australia    2022-Q2        1256.2

[5768 rows x 3 columns]

In [67]:
new_awe_data_df.to_csv("Resources/johan_awe_employment_clean.csv", index=False)
average_aernings_df.to_csv("Resources/johan_average_earnings_clean.csv", index=False)

### Connect to local database

In [68]:
protocol = 'postgresql'
username = 'postgres'
password = 'Fransien1'
host = 'localhost'
port = 5433
database_name = 'Project2'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)
insp = inspect(engine)

### Check for tables

In [70]:
insp.get_table_names()

['states',
 'average_earnings',
 'quarters',
 'population_change',
 'internal_arrival',
 'internal_departures',
 'internal_net_change',
 'analysis_table']

### Use pandas to load csv converted DataFrame into database

In [124]:
#check if the DF is goof to load
new_test_region_df.head()

   state_id                     state_name
0       214                      Australia
1      1420   Australian Capital Territory
2      1309                New South Wales
3      2838             Northern Territory
4      2292                     Queensland

In [125]:
#load STATES DB with teh data from the DF
new_test_region_df.to_sql(name='states', con=engine, if_exists='append', index=False)

In [149]:
#check if the DF is goof to load
new_test_quarter_df.head()

   quarter_id date_quarter
0        1639      1981-Q2
1        2788      1981-Q3
2        1969      1981-Q4
3        1314      1982-Q1
4        2955      1982-Q2

In [150]:
#load STATES DB with teh data from the DF
new_test_quarter_df.to_sql(name='quarters', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying
* NOTE: can also check using pgAdmin

In [126]:
#TEST States DB to see if the dada loaded
pd.read_sql_query('select * from states', con=engine).head()

   state_id                     state_name
0       214                      Australia
1      1420   Australian Capital Territory
2      1309                New South Wales
3      2838             Northern Territory
4      2292                     Queensland

In [151]:
#TEST States DB to see if the dada loaded
pd.read_sql_query('select * from quarters', con=engine).head()

   quarter_id date_quarter
0        1639      1981-Q2
1        2788      1981-Q3
2        1969      1981-Q4
3        1314      1982-Q1
4        2955      1982-Q2

### Confirm data has been added by querying

In [127]:
pd.read_sql_query('select * from states', con=engine).head()

   state_id                     state_name
0       214                      Australia
1      1420   Australian Capital Territory
2      1309                New South Wales
3      2838             Northern Territory
4      2292                     Queensland